#!/usr/bin/env python
# -*- coding: utf-8 -*-

import sys
import re
import json

PHPHEAD = re.compile(r'<\?php.+?/\*.+?\*/', re.DOTALL)
VARS = re.compile(r'\$(\w+?) = array\(\s+(.+?)\s+\);', re.DOTALL)

SIMPONLY = (
'㐽㑇㑈㑔㑩㓥㔉㖊㖞㘎㚯㛀㛟㛠㛣㛤㛿㟆㟜㤘㧏㧐㧑㧟㧰㨫㭎㭏㭣㭤㭴㱩㱮㲿㳔㳕㳠㳡㳢㳽'
'㶉㶶㶽㺍㻅㻏㻘䀥䁖䂵䅉䅪䇲䉤䌶䌷䌸䌹䌺䌻䌼䌽䌾䍀䍁䓕䗖䘛䘞䙊䙌䙓䜣䜤䜥䜧䜩䝙䞌䞍'
'䞎䞐䟢䢀䢁䢂䥺䥽䥾䥿䦀䦁䦂䦃䦅䦶䦷䭪䯃䯄䯅䲝䲞䲟䲠䲡䲢䲣䴓䴔䴕䴖䴗䴘䴙䶮万与丑专'
'业丛东丝丢两严丧个丰临为丽举么义乌乐乔习乡书买乱争于亏云亚产亩亲亵亸亿仅仆从仑仓'
'仪们价众优会伛伞伟传伡伣伤伥伦伧伪伫体佣佥侠侣侥侦侧侨侩侪侬俣俦俨俩俪俫俭债倾偬'
'偻偾偿傥傧储傩儿克兑兖党兰关兴兹养兽冁内冈册写军农冯冲决况冻净准凉减凑凛几凤凫凭'
'凯击凿刍划刘则刚创删别刬刭刮制刹刽刾刿剀剂剐剑剥剧劝办务劢动励劲劳势勋勚匀匦匮区'
'医华协单卖卢卤卫却厂厅历厉压厌厍厐厕厘厢厣厦厨厩厮县叁参双发变叙叠只叶号叹叽同向'
'吓吕吗吣吨听启吴呐呒呓呕呖呗员呙呛呜咏咙咛咝咤咸响哑哒哓哔哕哗哙哜哝哟唛唝唠唡唢'
'唤啧啬啭啮啯啰啴啸喷喽喾嗫嗳嘘嘤嘱噜嚣团园困囱围囵国图圆圣圹场坂坏块坚坛坜坝坞坟'
'坠垄垅垆垒垦垩垫垭垱垲垴埘埙埚埯堑堕墙壮声壳壶壸处备复够头夸夹夺奁奂奋奖奥奸妆妇'
'妈妩妪妫姗姹娄娅娆娇娈娱娲娴婳婴婵婶媪媭嫒嫔嫱嬷孙学孪宁宝实宠审宪宫宽宾寝对寻导'
'寿将尔尘尝尧尴尸尽层屃屉届属屡屦屿岁岂岖岗岘岙岚岛岭岽岿峄峡峣峤峥峦崂崃崄崭嵘嵚'
'嵝巅巩巯币帅师帏帐帘帜带帧帮帱帻帼幂并广庄庆庐庑库应庙庞废廪开异弃弑张弥弪弯弹'
'强归当录彝彟彦彨彻径徕御忆忏忧忾怀态怂怃怄怅怆怜总怼怿恋恒恳恶恸恹恺恻恼恽悦悫悬'
'悭悮悯惊惧惨惩惫惬惭惮惯愠愤愦慑懑懒懔戆戋戏戗战戬戯户扑执扩扪扫扬扰抚抛抟抠抡抢'
'护报担拟拢拣拥拦拧拨择挂挚挛挜挝挞挟挠挡挢挣挤挥挦挽捝捞损捡换捣据掳掴掷掸掺掼揽'
'揾揿搀搁搂搅携摄摅摆摇摈摊撄撑撵撷撸撺擞攒敌敛敩数斋斓斗斩断无旧时旷旸昙昼昽显晋'
'晒晓晔晕晖暂暧术朴机杀杂权杆条来杨杩杰松板构枞枢枣枥枧枨枪枫枭柜柠柽栀栅标栈栉栊'
'栋栌栎栏树栖栗样栾桠桡桢档桤桥桦桧桨桩桪梦梼梾梿检棁棂椁椝椟椠椢椤椫椭楼榄榅榇榈'
'榉槚槛槟槠横樯樱橥橱橹橼檩欢欤欧歼殁殇残殒殓殚殡殴毁毂毕毙毡毵氇气氢氩氲汇汉汤汹'
'沈沟没沣沤沥沦沧沨沩沪泞注泪泶泷泸泺泻泼泽泾洁洒洼浃浅浆浇浈浊测浍济浏浐浑浒浓浔'
'浕涂涛涝涞涟涠涡涢涣涤润涧涨涩淀渊渌渍渎渐渑渔渗温湾湿溃溅溆溇滗滚滞滟滠满滢滤滥'
'滦滨滩滪漓漤潆潇潋潍潜潴澛澜濑濒灏灭灯灵灾灿炀炉炜炝点炼炽烁烂烃烛烟烦烧烨烩烫烬'
'热焕焖焘煴爱爷牍牦牵牺犊状犷犸犹狈狝狞独狭狮狯狰狱狲猃猎猕猡猪猫猬献獭玑玚玛玮环'
'现玱玺珐珑珰珲琏琐琼瑶瑷璎瓒瓯电画畅畴疖疗疟疠疡疬疭疮疯疱疴症痈痉痒痖痨痪痫瘅瘆'
'瘗瘘瘪瘫瘾瘿癞癣癫皑皱皲盏盐监盖盗盘眍眦眬着睁睐睑瞆瞒瞩矫矶矾矿砀码砖砗砚砜砺砻'
'砾础硁硕硖硗硙硚确硵硷碍碛碜礼祃祎祢祯祷祸禀禄禅离秃秆种积称秽秾稆税稣稳穑穷窃窍'
'窎窑窜窝窥窦窭竖竞笃笋笔笕笺笼笾筑筚筛筜筝筹筼签简箓箦箧箨箩箪箫篑篓篮篯篱簖籁籴'
'类籼粜粝粤粪粮糁糇系紧累絷纟纠纡红纣纤纥约级纨纩纪纫纬纭纮纯纰纱纲纳纴纵纶纷纸纹'
'纺纻纼纽纾线绀绁绂练组绅细织终绉绊绋绌绍绎经绐绑绒结绔绕绖绗绘给绚绛络绝绞统绠绡'
'绢绣绤绥绦继绨绩绪绫绬续绮绯绰绱绲绳维绵绶绷绸绹绺绻综绽绾绿缀缁缂缃缄缅缆缇缈缉'
'缊缋缌缍缎缏缑缒缓缔缕编缗缘缙缚缛缜缝缞缟缠缡缢缣缤缥缦缧缨缩缪缫缬缭缮缯缰缱缲'
'缳缴缵罂网罗罚罢罴羁羟翘翙翚耢耧耸耻聂聋职聍联聩聪肃肠肤肮肴肾肿胀胁胆胜胡胧胨胪'
'胫胶脉脍脏脐脑脓脔脚脱脶脸腊腘腭腻腼腽腾膑臜致舆舍舣舰舱舻艰艳艺节芈芗芜芦芸苁苇'
'苈苋苌苍苎苏苹范茎茏茑茔茕茧荆荐荙荚荛荜荝荞荟荠荡荣荤荥荦荧荨荩荪荫荬荭荮药莅莱'
'莲莳莴莶获莸莹莺莼萝萤营萦萧萨葱蒇蒉蒋蒌蓝蓟蓠蓣蓥蓦蔂蔷蔹蔺蔼蕰蕲蕴薮藓蘖虏虑虚'
'虫虬虮虽虾虿蚀蚁蚂蚃蚕蚬蛊蛎蛏蛮蛰蛱蛲蛳蛴蜕蜗蝇蝈蝉蝼蝾螀螨蟏衅衔补表衬衮袄袅袆'
'袜袭袯装裆裈裢裣裤裥褛褴襕见观觃规觅视觇览觉觊觋觌觍觎觏觐觑觞触觯訚詟誉誊讠计订'
'讣认讥讦讧讨让讪讫讬训议讯记讱讲讳讴讵讶讷许讹论讻讼讽设访诀证诂诃评诅识诇诈诉诊'
'诋诌词诎诏诐译诒诓诔试诖诗诘诙诚诛诜话诞诟诠诡询诣诤该详诧诨诩诪诫诬语诮误诰诱诲'
'诳说诵诶请诸诹诺读诼诽课诿谀谁谂调谄谅谆谇谈谊谋谌谍谎谏谐谑谒谓谔谕谖谗谘谙谚谛'
'谜谝谞谟谠谡谢谣谤谥谦谧谨谩谪谫谬谭谮谯谰谱谲谳谴谵谶谷豮贝贞负贠贡财责贤败账货'
'质贩贪贫贬购贮贯贰贱贲贳贴贵贶贷贸费贺贻贼贽贾贿赀赁赂赃资赅赆赇赈赉赊赋赌赍赎赏'
'赐赑赒赓赔赕赖赗赘赙赚赛赜赝赞赟赠赡赢赣赪赵赶趋趱趸跃跄跞践跶跷跸跹跻踊踌踪踬踯'
'蹑蹒蹰蹿躏躜躯车轧轨轩轪轫转轭轮软轰轱轲轳轴轵轶轷轸轹轺轻轼载轾轿辀辁辂较辄辅辆'
'辇辈辉辊辋辌辍辎辏辐辑辒输辔辕辖辗辘辙辚辞辩辫边辽达迁过迈运还这进远违连迟迩迳迹'
'适选逊递逦逻遗遥邓邝邬邮邹邺邻郁郏郐郑郓郦郧郸酂酝酦酱酽酾酿采释里鉴銮錾钅钆钇针'
'钉钊钋钌钍钎钏钐钑钒钓钔钕钖钗钘钙钚钛钜钝钞钟钠钡钢钣钤钥钦钧钨钩钪钫钬钭钮钯钰'
'钱钲钳钴钵钶钷钸钹钺钻钼钽钾钿铀铁铂铃铄铅铆铇铈铉铊铋铌铍铎铏铐铑铒铓铔铕铖铗铘'
'铙铚铛铜铝铞铟铠铡铢铣铤铥铦铧铨铩铪铫铬铭铮铯铰铱铲铳铴铵银铷铸铹铺铻铼铽链铿销'
'锁锂锃锄锅锆锇锈锉锊锋锌锍锎锏锐锑锒锓锔锕锖锗锘错锚锛锜锝锞锟锠锡锢锣锤锥锦锧锨'
'锩锪锫锬锭键锯锰锱锲锳锴锵锶锷锸锹锺锻锼锽锾锿镀镁镂镃镄镅镆镇镈镉镊镋镌镍镎镏镐'
'镑镒镓镔镕镖镗镘镙镚镛镜镝镞镟镠镡镢镣镤镥镦镧镨镩镪镫镬镭镮镯镰镱镲镳镴镵镶长门'
'闩闪闫闬闭问闯闰闱闲闳间闵闶闷闸闹闺闻闼闽闾闿阀阁阂阃阄阅阆阇阈阉阊阋阌阍阎阏阐'
'阑阒阓阔阕阖阗阘阙阚阛队阳阴阵阶际陆陇陈陉陕陧陨险随隐隶隽难雏雠雳雾霁霡霭靓静面'
'靥鞑鞒鞯韦韧韨韩韪韫韬韵页顶顷顸项顺须顼顽顾顿颀颁颂颃预颅领颇颈颉颊颋颌颍颎颏颐'
'频颒颓颔颕颖颗题颙颚颛颜额颞颟颠颡颢颣颤颥颦颧风飏飐飑飒飓飔飕飖飗飘飙飚飞飨餍饣'
'饤饥饦饧饨饩饪饫饬饭饮饯饰饱饲饳饴饵饶饷饸饹饺饻饼饽饾饿馀馁馂馃馄馅馆馇馈馉馊馋'
'馌馍馎馏馐馑馒馓馔馕马驭驮驯驰驱驲驳驴驵驶驷驸驹驺驻驼驽驾驿骀骁骂骃骄骅骆骇骈骉'
'骊骋验骍骎骏骐骑骒骓骔骕骖骗骘骙骚骛骜骝骞骟骠骡骢骣骤骥骦骧髅髋髌鬓鬶魇魉鱼鱽鱾'
'鱿鲀鲁鲂鲃鲄鲅鲆鲈鲉鲊鲋鲌鲍鲎鲏鲐鲑鲒鲓鲔鲕鲖鲗鲘鲙鲚鲛鲜鲝鲞鲟鲠鲡鲢鲣鲤鲥鲦鲧'
'鲨鲩鲪鲫鲬鲭鲮鲯鲰鲱鲲鲳鲴鲵鲷鲸鲹鲺鲻鲼鲽鲾鲿鳀鳁鳂鳃鳄鳅鳆鳇鳈鳉鳊鳋鳌鳍鳎鳏鳐'
'鳑鳒鳓鳔鳕鳖鳗鳘鳙鳚鳛鳜鳝鳞鳟鳠鳡鳢鳣鸟鸠鸡鸢鸣鸤鸥鸦鸧鸨鸩鸪鸫鸬鸭鸮鸯鸰鸱鸲鸳'
'鸴鸵鸶鸷鸸鸹鸺鸻鸼鸽鸾鸿鹀鹁鹂鹃鹄鹅鹆鹇鹈鹉鹊鹋鹌鹍鹎鹏鹐鹑鹒鹓鹔鹕鹖鹗鹘鹙鹚鹛'
'鹜鹝鹞鹟鹠鹡鹢鹣鹤鹥鹦鹧鹨鹩鹪鹫鹬鹭鹮鹯鹰鹱鹲鹳鹴鹾麦麸黄黉黡黩黪黾鼋鼍鼗鼹齐齑'
'齿龀龁龂龃龄龅龆龇龈龉龊龋龌龙龚龛龟𠆲𠆿𠉂𠉗𠚳𠛅𠛆𠯟𠯠𠲥𠴢𠵸𠵾𡋀𡋗𡒄𡝠𡞱𡭜𡭬𡶴𢋈'
'𢘝𢘞𢙓𢛯𢫊𢫞𢫬𢬦𢭏𢽾𣆐𣍨𣍯𣍰𣎑𣐤𣑶𣗋𣘓𣘴𣘷𣭤𣶩𣶫𣸣𣺼𣺽𣽷𤆡𤇃𤇄𤈶𤈷𤊀𤋏𤞤𤠋𤦀𤳄𤶧'
'𤽯𤾀𥅘𥅴𥆧𥇢𥐟𥐯𥐰𥐻𥧂𥬀𥬞𥬠𥭉𥮋𥮜𥱔𥹥𥺅𥺇𦈈𦈉𦈋𦈌𦈎𦈏𦈐𦈑𦈒𦈓𦈔𦈕𦈖𦈗𦈘𦈙𦈚𦈛𦈜'
'𦈝𦈞𦈟𦈠𦈡𦛨𦝼𦟗𦨩𦰴𧉞𧒭𧮪𧳕𧹑𧹓𧹕𧹖𧹗𧿈𨀱𨁴𨂺𨄄𨅫𨅬𨉗𨐅𨐆𨐇𨐈𨐉𨐊𨑹𨤰𨰾𨰿𨱀𨱁𨱂'
'𨱃𨱄𨱅𨱆𨱇𨱈𨱉𨱊𨱋𨱌𨱍𨱎𨱏𨱐𨱑𨱒𨱓𨱔𨱕𨱖𨷿𨸀𨸁𨸂𨸃𨸄𨸅𨸆𨸇𨸉𨸊𨸋𨸌𨸎𨸘𨸟𩏼𩏽𩏾𩏿'
'𩐀𩖕𩖖𩖗𩙥𩙦𩙧𩙨𩙩𩙪𩙫𩙬𩙭𩙮𩙯𩙰𩟿𩠀𩠁𩠂𩠃𩠅𩠆𩠇𩠈𩠉𩠊𩠋𩠌𩠎𩠏𩠠𩧦𩧨𩧩𩧪𩧫𩧬𩧭𩧮'
'𩧯𩧰𩧱𩧲𩧳𩧴𩧵𩧶𩧺𩧼𩧿𩨀𩨁𩨃𩨄𩨅𩨆𩨇𩨈𩨉𩨊𩨋𩨌𩨍𩨎𩨏𩨐𩬣𩬤𩯒𩲒𩽹𩽺𩽻𩽼𩽽𩽾𩽿𩾁𩾂'
'𩾃𩾄𩾅𩾆𩾇𩾈𩾊𩾋𩾌𪉂𪉃𪉄𪉅𪉆𪉈𪉉𪉊𪉋𪉌𪉍𪉎𪉏𪉐𪉑𪉒𪉔𪉕𪎈𪎉𪎊𪎋𪎍𪔭𪚏𪚐𪞝𪡏𪢮𪨊𪨗'
'𪻐𪾢𫁡𫂈𫄨𫄸𫌀𫌨𫍙𫍟𫍢𫍰𫍲𫏋𫐄𫐆𫐉𫐐𫐓𫓧𫓩𫔎𫖸𫗠𫗦𫗧𫗮𫗴𫘝𫘣𫘤𫘨𫚈𫚉𫚒𫚔𫚕𫚙𫛛𫛞'
'𫛢𫛶𫛸'
)


TRADONLY = (
'㑯㑳㒓㓨㗲㘚㜄㜏㜢㜷㞞㠏㢝㥮㦎㩜㩳㷿㺏㿧䀹䁪䁻䉙䉬䉲䊭䊷䋙䋚䋻䋿䌈䌋䌖䌝䌟䌥䌰䕳'
'䗿䙡䜀䝻䝼䞈䢨䥇䥩䥱䦘䦛䦟䦳䧢䪏䪗䪘䫴䬘䬝䬞䭀䭃䭿䮝䮞䮠䮫䮳䮾䯀䰾䱙䱬䱰䱷䱽䲁䲖'
'䲰䴉䴬䴴丟並乾亂亞佇併來侖侶俁係俔俠俥倀倆倈倉個們倫倲偉偑側偵偽傑傖傘備傭傯傳傴'
'債傷傾僂僅僉僑僕僞僥僨價儀儂億儈儉儐儔儕儘償儣優儲儷儸儺儻儼兌兒兗內兩冊冪凈凍凙'
'凜凱別刪剄則剋剎剗剛剝剮剴創剾劃劇劉劊劌劍劏劑劚勁動務勛勝勞勢勩勱勵勸勻匭匯匱區'
'協卻厙厭厲厴參叄叢吒吳吶呂咼員哯唄唚問啞啟啢喎喚喪喬單喲嗆嗇嗊嗎嗚嗩嗶嗹嘆嘍嘓嘔'
'嘖嘗嘜嘩嘮嘯嘰嘵嘸嘽噅噓噚噝噠噥噦噯噲噴噸噹嚀嚇嚌嚕嚙嚦嚨嚲嚳嚴嚶囀囁囂囅囈囉囑'
'囪圇國圍園圓圖團圞垵埡埰執堅堊堖堝堯報場塊塋塏塒塗塢塤塵塹墊墜墮墳墾壇壈壋壓壘壙'
'壚壞壟壠壢壩壯壺壼壽夠夢夾奐奧奩奪奮奼妝姍姦娛婁婦婭媧媯媰媼媽嫗嫵嫻嫿嬃嬈嬋嬌嬙'
'嬡嬤嬪嬰嬸孋孌孫學孿宮寢實寧審寫寬寵寶將專尋對導尷屆屍屓屜屢層屨屩屬岡峴島峽崍崗'
'崢崬嵐嵼嶁嶄嶇嶔嶗嶠嶢嶧嶮嶴嶸嶺嶼巋巒巔巰帥師帳帶幀幃幗幘幟幣幫幬幹幺幾庫廁廂廄'
'廈廚廝廟廠廡廢廣廩廬廳弒弳張強彈彌彎彙彞彠彥彲後徑從徠復徹恆恥悅悞悵悶惡惱惲惻愛'
'愜愨愴愷愾慄態慍慘慚慟慣慪慫慮慳慶憂憊憐憑憒憚憤憫憮憲憶懀懇應懌懍懟懣懨懲懶懷懸'
'懺懼懾戀戇戔戧戩戰戱戲戶拋挩挾捨捫掃掄掆掗掙掛採揀揚換揮損搖搗搵搶摋摑摜摟摯摳摶'
'摻撈撏撐撓撝撟撣撥撫撲撳撻撾撿擁擄擇擊擋擓擔據擠擣擬擯擰擱擲擴擷擺擻擼擽擾攄攆攏'
'攔攖攙攛攜攝攢攣攤攪攬敗敘敵數斂斃斅斆斕斬斷於時晉晝暈暉暘暢暫曄曆曇曉曏曖曠曥曨'
'曬書會朥朧東杴柵桿梔梘條梟梲棄棖棗棟棡棧棲棶椏椲楊楓楨業極榪榮榲榿構槍槤槧槨槳槶'
'槼樁樂樅樓標樞樢樣樫樳樸樹樺樿橈橋機橢橫檁檉檔檜檟檢檣檭檮檯檳檸檻櫃櫓櫚櫛櫝櫞櫟'
'櫥櫧櫨櫪櫫櫬櫱櫳櫸櫻欄權欍欏欒欓欖欞欽歐歟歡歲歷歸歿殘殞殤殨殫殮殯殰殲殺殼毀毆毿'
'氂氈氌氣氫氬氳決沒沖況洶浹涇涼淚淥淪淵淶淺渙減渢渦測渾湊湞湯溈準溝溫溳滄滅滌滎滬'
'滯滲滸滻滾滿漁漊漚漢漣漬漲漵漸漿潁潑潔潛潤潯潰潷潿澀澅澆澇澗澠澤澦澩澮澱澾濁濃濄'
'濆濕濘濜濟濤濧濫濰濱濺濼濾瀂瀃瀅瀆瀇瀉瀋瀏瀕瀘瀝瀟瀠瀦瀧瀨瀰瀲瀾灃灄灑灕灘灙灝灠'
'灡灣灤灧災為烏烴無煉煒煙煢煥煩煬煱熅熉熌熒熓熗熡熱熲熾燁燈燒燙燜營燦燭燴燶燼燾爄'
'爍爐爛爭爺爾牆牘牽犖犢犧狀狹狽猙猶猻獁獄獅獎獨獪獫獮獰獱獲獵獷獸獺獻獼玀玁現琺琿'
'瑋瑒瑣瑤瑩瑪瑲瑽璉璣璦璫璯環璽瓊瓏瓔瓕瓚甌產畝畢畫異當疇疊痙痾瘂瘋瘍瘓瘞瘡瘧瘮瘲'
'瘺療癆癇癉癘癟癢癤癥癧癩癬癭癮癰癱癲發皚皟皰皸皺盜盞盡監盤盧盪眥眾睍睏睜睞瞘瞜瞞'
'瞤瞶瞼矓矚矯硜硤硨硯碙碩碭碸確碼碽磑磚磠磣磧磯磽礄礆礎礒礙礦礪礫礬礱祿禍禎禕禡禦'
'禪禮禰禱禿秈稅稈稏稟種稱穀穌積穎穠穡穢穩穫穭窩窪窮窯窵窶窺竄竅竇竊競筆筍筧筴箋箏'
'節範築篋篔篘篤篩篳簀簍簞簡簣簫簹簽簾籃籋籌籔籙籛籜籟籠籩籪籬籮粵糝糞糧糲糴糶糹糾'
'紀紂約紅紆紇紈紉紋納紐紓純紕紖紗紘紙級紛紜紝紡紬細紱紲紳紵紹紺紼紿絀終組絅絆絎結'
'絕絛絝絞絡絢給絨絰統絲絳絹絺綀綁綃綆綇綈綌綏綐經綜綞綠綢綣綬維綯綰綱網綴綵綸綹綺'
'綻綽綾綿緄緇緊緋緍緒緓緗緘緙線緝緞締緡緣緦編緩緬緯緰緱緲練緶緷緸緹緻縈縉縊縋縎縐'
'縑縕縗縛縝縞縟縣縫縬縭縮縱縲縳縵縶縷縹縺總績繃繅繆繏繒繓織繕繚繞繟繡繢繩繪繫繭繯'
'繰繳繸繹繻繼繽繾繿纁纇纈纊續纍纏纓纖纘纜缽罈罌罰罵罷羅羆羈羋羥義習翬翹翽耬耮聖聞'
'聯聰聲聳聵聶職聹聽聾肅脅脈脛脥脫脹腎腖腡腦腪腫腳腸膃膕膚膠膢膩膽膾膿臉臍臏臗臘臚'
'臟臠臢臨臺與興舉舊艙艤艦艫艱艷芻茲荊莊莖莢莧華萇萊萬萴萵葉葒著葤葦葷蒔蒞蒼蓀蓋蓮'
'蓯蓴蓽蔞蔣蔥蔦蔭蕁蕆蕎蕒蕓蕕蕘蕢蕩蕪蕭蕷薀薈薊薌薔薘薟薦薩薳薴薺藍藎藝藥藪藶藹藺'
'蘄蘆蘇蘊蘋蘚蘞蘢蘭蘺蘿虆處虛虜號虧虯蛺蛻蜆蝕蝟蝦蝸螄螞螢螮螻螿蟄蟈蟎蟣蟬蟯蟲蟶蟻'
'蠁蠅蠆蠐蠑蠟蠣蠨蠱蠶蠻術衕衚衛衝袞裊補裝裡製複褌褘褲褳褸褻襀襉襏襖襝襠襤襪襬襯襲'
'襴覆見覎規覓視覘覡覥覦親覬覯覲覷覺覼覽覿觀觴觶觸訁訂訃計訊訌討訐訑訒訓訕訖託記訛'
'訝訟訢訣訥訩訪設許訴訶診註詀詁詆詎詐詑詒詔評詖詗詘詛詞詠詡詢詣試詩詫詬詭詮詰話該'
'詳詵詼詿誄誅誆誇誌認誑誒誕誘誚語誠誡誣誤誥誦誨說誰課誶誹誼誾調諂諄談諉請諍諏諑諒'
'論諗諛諜諝諞諢諤諦諧諫諭諮諰諱諳諶諷諸諺諼諾謀謁謂謄謅謊謎謏謐謔謖謗謙謚講謝謠謨'
'謫謬謳謹謾證譊譎譏譖識譙譚譜譫譯議譴護譸譽譾讀變讋讌讎讒讓讕讖讜讞豈豎豐豬豶貓貙'
'貝貞貟負財貢貧貨販貪貫責貯貰貲貳貴貶買貸貺費貼貽貿賀賁賂賃賄賅資賈賊賑賒賓賕賙賚'
'賜賞賟賠賡賢賣賤賦賧質賬賭賰賴賵賺賻購賽賾贃贄贅贇贈贊贍贏贐贓贔贖贗贛赬趕趙趨趲'
'跡踐踴蹌蹕蹣蹤蹺蹻躂躉躊躋躍躎躑躒躓躕躚躝躡躥躦躪軀軉車軋軌軍軏軑軒軔軗軛軟軤軨'
'軫軲軸軹軺軻軼軾較輄輅輇輈載輊輒輓輔輕輗輛輜輝輞輟輥輦輩輪輬輮輯輳輸輻輾輿轀轂轄'
'轅轆轉轍轎轔轟轡轢轣轤辦辭辮辯農逕這連進運過達違遙遜遞遠適遲遷選遺遼邁還邇邊邏邐'
'郟郵鄆鄉鄒鄔鄖鄧鄭鄰鄲鄴鄶鄺酇酈醜醞醫醬醱釀釁釃釅釋釐釒釓釔釕釗釘釙針釣釤釧釩釳'
'釵釷釹釺釾鈀鈁鈃鈄鈇鈈鈉鈋鈍鈐鈑鈒鈔鈕鈞鈠鈣鈥鈦鈧鈮鈯鈰鈲鈳鈴鈷鈸鈹鈺鈽鈾鈿鉀鉁'
'鉅鉈鉉鉋鉍鉑鉕鉗鉚鉛鉞鉤鉦鉬鉭鉶鉸鉺鉻鉿銀銃銅銍銑銓銖銘銚銛銜銠銣銥銦銨銩銪銫銬'
'銱銳銶銷銻銼鋁鋃鋅鋇鋉鋌鋏鋒鋙鋝鋟鋣鋤鋥鋦鋨鋩鋪鋮鋯鋰鋱鋶鋸鋼錁錂錄錆錇錈錏錐錒'
'錕錘錙錚錛錟錠錡錢錦錨錩錫錮錯錳錶錸鍀鍃鍄鍆鍇鍈鍋鍍鍔鍘鍚鍛鍠鍤鍥鍩鍬鍮鍰鍵鍶鍺'
'鍾鎂鎄鎇鎊鎔鎖鎘鎛鎝鎡鎢鎣鎦鎧鎩鎪鎬鎮鎯鎰鎲鎳鎵鎷鎿鏃鏆鏇鏈鏉鏌鏍鏐鏑鏗鏘鏜鏝鏞'
'鏟鏡鏢鏤鏦鏨鏰鏵鏷鏹鏺鏽鐃鐄鐋鐍鐎鐏鐐鐒鐓鐔鐘鐙鐠鐥鐦鐧鐨鐫鐮鐯鐲鐳鐵鐶鐸鐺鐿鑄'
'鑊鑌鑒鑔鑕鑞鑠鑣鑥鑭鑰鑱鑲鑷鑹鑼鑽鑾鑿钁長門閂閃閆閈閉開閌閍閎閏閐閑間閔閘閡閣閥'
'閨閩閫閬閭閱閶閹閻閼閽閾閿闃闆闈闊闋闌闍闐闒闓闔闕闖關闞闠闡闤闥阪陘陝陣陰陳陸陽'
'隉隊階隕際隨險隱隴隸隻雋雖雙雛雜雞離難雲電霢霧霽靂靄靈靚靜靦靨鞀鞏鞝鞽韁韃韉韋韌'
'韍韓韙韜韞韻響頁頂頃項順頇須頊頌頎頏預頑頒頓頗領頜頡頤頦頭頮頰頲頴頷頸頹頻顃顆題'
'額顎顏顒顓願顙顛類顢顥顧顫顬顯顰顱顳顴風颭颮颯颰颱颳颶颷颸颺颻颼颾飀飄飆飈飛飠飢'
'飣飥飩飪飫飭飯飲飴飼飽飾飿餃餄餅餉養餌餎餏餑餒餓餔餕餖餗餘餚餛餜餞餡餦館餭餱餳餶'
'餷餸餺餼餾餿饁饃饅饈饉饊饋饌饒饗饘饜饞饢馬馭馮馱馳馴馹駁駃駎駐駑駒駔駕駘駙駚駛駝'
'駟駢駧駩駭駰駱駶駸駻駿騁騂騃騅騌騍騎騏騔騖騙騚騝騟騠騤騧騪騫騭騮騰騶騷騸騾驀驁驂'
'驃驄驅驊驋驌驍驏驕驗驚驛驟驢驤驥驦驪驫骯髏髒體髕髖髮鬆鬍鬚鬢鬥鬧鬩鬮鬱鬹魎魘魚魛'
'魟魢魥魨魯魴魷魺鮁鮃鮄鮊鮋鮍鮐鮑鮒鮓鮚鮜鮞鮟鮣鮦鮪鮫鮭鮮鮰鮳鮶鮸鮺鯀鯁鯄鯆鯇鯉鯊'
'鯒鯔鯕鯖鯗鯛鯝鯡鯢鯤鯧鯨鯪鯫鯱鯴鯶鯷鯽鯿鰁鰂鰃鰆鰈鰉鰌鰍鰏鰒鰓鰜鰟鰠鰣鰤鰥鰧鰨鰩'
'鰭鰮鰱鰲鰳鰵鰷鰹鰺鰻鰼鰾鱂鱅鱇鱈鱉鱒鱔鱖鱗鱘鱝鱟鱠鱣鱤鱧鱨鱭鱮鱯鱷鱸鱺鳥鳧鳩鳲鳳'
'鳴鳶鳷鳼鳾鴃鴆鴇鴉鴒鴕鴗鴛鴜鴝鴞鴟鴣鴦鴨鴯鴰鴲鴴鴷鴻鴿鵁鵂鵃鵐鵑鵒鵓鵚鵜鵝鵠鵡鵪'
'鵬鵮鵯鵲鵷鵾鶄鶇鶉鶊鶒鶓鶖鶗鶘鶚鶡鶥鶩鶪鶬鶯鶲鶴鶹鶺鶻鶼鶿鷁鷂鷈鷊鷓鷔鷖鷗鷙鷚鷥'
'鷦鷨鷫鷯鷲鷳鷸鷹鷺鷽鷿鸂鸇鸋鸌鸏鸕鸘鸚鸛鸝鸞鹵鹹鹺鹼鹽麗麥麨麩麲麵麼麽黃黌點黨黲'
'黶黷黽黿鼉鼴齊齋齎齏齒齔齕齗齙齜齟齠齡齦齪齬齲齶齷龍龎龐龑龔龕龜龭龯鿁𠌥𠏢𠞆𠠎𡄔'
'𡄣𡅏𡑭𡓾𡞵𡠹𡢃𡮉𡮣𡾱𢣚𢣭𢶫𢷮𢹿𣙎𣝕𣞻𣠲𣯴𣾷𣿉𤁣𤒎𤪺𤫩𤳸𤸫𥌃𥕥𥖅𥢢𥨐𥵃𥵊𥸠𥼽𥽖𥿊𦂅'
'𦃄𦢈𦣎𦪽𧔥𧜗𧜵𧝞𧩙𧳟𧵳𧶔𧶧𨄣𨅍𨇁𨇞𨈊𨈌𨊰𨊸𨊻𨋢𨎮𨏠𨏥𨤻𨥛𨦫𨧜𨧱𨫒𨮂𨯅𨳑𨳕𨴗𨵩𨵸𨶀'
'𨶏𨶮𨶲𨷲𨽏𩎢𩏪𩓣𩗀𩘀𩘝𩘹𩘺𩙈𩚛𩚥𩚵𩛆𩛩𩜇𩜦𩜵𩝔𩞄𩞦𩞯𩟐𩠴𩡺𩢡𩢴𩢸𩢾𩣏𩣑𩣺𩤊𩤙𩤲𩤸'
'𩥄𩥇𩥉𩥑𩧆𩭙𩯳𩰀𩳤𩵩𩵹𩶘𩶰𩶱𩷰𩸃𩸦𩿪𪀦𪀾𪁈𪁖𪂆𪃍𪃏𪄆𪄕𪇳𪋿𪔵𪘀𪘯'
)

if sys.version_info[0] < 3:
    SIMPONLY = SIMPONLY.decode('utf-8')
    TRADONLY = TRADONLY.decode('utf-8')

def convert(phpfile):
    f = PHPHEAD.sub('', phpfile)
    matches = VARS.findall(f)
    zhcdict = {}
    for i in matches:
        groups = i[1].rstrip(',').split(',')
        zhcdict[i[0]] = dict(
            ((w.strip("' ") for w in g.strip().split('=>')) for g in groups))
    return zhcdict


def main():
    if len(sys.argv) > 1:
        filename = sys.argv[1]
    else:
        filename = 'ZhConversion.php'
    with open(filename, 'r') as f:
        phpfile = f.read()
    if sys.version_info[0] < 3:
        phpfile = unicode(phpfile, 'utf-8')
    je = json.JSONEncoder(ensure_ascii=False, indent=0, separators=(',', ': '), sort_keys=True)
    zhdict = convert(phpfile)
    zhdict['SIMPONLY'] = SIMPONLY
    zhdict['TRADONLY'] = TRADONLY
    with open('zhcdict.json', 'wb') as f:
        for chunk in je.iterencode(zhdict):
            f.write(chunk.encode('utf-8'))

if __name__ == '__main__':
    main()
